In [3]:
import numpy as np
import pandas as pd

In [50]:
data = {
    '날짜' : ['3/20','3/21','3/22','3/23','3/24'],
    '매출 편차' : np.random.randn(5),
    '손님 평균 연령' : np.random.randint(10,60,5)
}

df = pd.DataFrame(data)
df

     날짜     매출 편차  손님 평균 연령
0  3/20 -2.280412        38
1  3/21  1.325377        43
2  3/22 -0.146298        30
3  3/23 -0.067574        43
4  3/24  2.020324        27

In [21]:
df['매출 편차']

0    0.404944
1   -1.775099
2    0.452946
3    1.134043
4   -0.514151
Name: 매출 편차, dtype: float64

In [22]:
df[df['손님 평균 연령']>=20]

     날짜     매출 편차  손님 평균 연령
1  3/21 -1.775099        52
3  3/23  1.134043        53
4  3/24 -0.514151        24

In [51]:
df.loc[2,'매출 편차'] = np.nan
df.iloc[4,2] = np.nan
df

     날짜     매출 편차  손님 평균 연령
0  3/20 -2.280412      38.0
1  3/21  1.325377      43.0
2  3/22       NaN      30.0
3  3/23 -0.067574      43.0
4  3/24  2.020324       NaN

In [28]:
df.isnull()

      날짜  매출 편차  손님 평균 연령
0  False  False     False
1  False  False     False
2  False   True     False
3  False  False     False
4  False  False      True

In [52]:
df.loc[2] = df.loc[2].fillna(0)
df

     날짜     매출 편차  손님 평균 연령
0  3/20 -2.280412      38.0
1  3/21  1.325377      43.0
2  3/22  0.000000      30.0
3  3/23 -0.067574      43.0
4  3/24  2.020324       NaN

In [56]:
df.loc[4] = df.loc[4].fillna(df['손님 평균 연령'].mean())
df

     날짜     매출 편차  손님 평균 연령
0  3/20 -2.280412      38.0
1  3/21  1.325377      43.0
2  3/22  0.000000      30.0
3  3/23 -0.067574      43.0
4  3/24  2.020324      38.5